<?php

namespace Database\Seeders;

use App\Models\Testimonial;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class TestimonialSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $now = now();
        $testimonials = [
            [
                'id' => 1,
                'name' => 'مها فوزي',
                'stars' => 5,
                'content' => 'سلام عليكم ورحمة الله وبركاته
مهندسة هدير🌺🌺
اولا جزاك الله خيرا علي كل حاجه حلوة عملتيها مع الولاد أنا سعيدة جداااا بعرفة حضرتك وسعيده أكتر بأداء حضرتك مع الولاد من أول المسابقة اللي كان ليها معاد واضح بنتظرها انا ومحمد علشان يحلها لتشجيع حضرتك اللطيف علي الحل اللي كان بيشجعه يستني المرة اللي بعدها 🥰🥰🥰 وبعد كده الهديه الروعه ديه😍😍
وحبه اقول لحضرتك إني بصراحه محستش للحظه أن الكورس ده مش مدفوع من أول ألتزام حضرتك بالمعاد لمتابعة الولاد وتشجيعهم فعلا جزاك الله خيرا 😘😘😘
واتمني نحضر مع حضرتك كورسات تاني🌹🌹🌹',
                'label' => 'Coding'
            ],
            [
                'id' => 2,
                'name' => 'اّمنه الفقيه',
                'stars' => 5,
                'content' => 'كانت تجربة جميلة مع استاذه هدير
متعاونة معنا بالمواعيد المناسبة لنا
تمتلك المهارة الممتازة بالتعامل مع الاطفال و تسهيل ايصال المعلومة للطفل
لدروس مشوقة وممتعة معها وغير مملة
عندها حلول وطرق عديدة دائما.',
                'label' => 'Mental Math'
            ],
            [
                'id' => 3,
                'name' => 'منار',
                'stars' => 5,
                'content' => 'شكرا جزيلا😍 يا م. هدير على تعبك مع الولاد  كان وقت للتعليم ممتع جدا للولاد استفادوا كتير معاكى وكانت تجربة ثرية وممتعة ويوم المسابقة كان رائع جدا والولاد كانوا متحمسين وفرحانين جدا 🥰🥰',
                'label' => 'FLL Competition'
            ],
            [
                'id' => 4,
                'name' => 'أمنية',
                'stars' => 5,
                'content' => 'جزاك الله خيرا ميس هدير على تعبك وصبرك مع الاولاد وكمان على المادة العلمية  حتى اللهم بارك وقت البريك بيكون ألعاب مفيدة وتواجدك خلال اى وقت فى الاسبوع للرد على استفسارات الاولاد و محمد بيكون مبسوط معاكى .. بالتوفيق دائما يارب ونتقابل فى المسابقة باذن الله 💪',
                'label' => 'FLL Competition'
            ],
            [
                'id' => 5,
                'name' => 'رضوى',
                'stars' => 5,
                'content' => 'حقيقي مهندسة هدير ربنا يبارك لحضرتك صبورة على الولاد وبتحتوي قدراتهم وبتبسطي المعلومات جدًا لحد ما يستوعبوا ويفهموا وفعلًا طريقة شرحك رائعة وبسيطة وكلها طولة بال اللهم بارك 💕',
                'label' => 'Mental Math'
            ],
            [
                'id' => 6,
                'name' => 'دينا',
                'stars' => 5,
                'content' => 'كورس بشمهندسه هدير كان ممتاز ابني اتعلم حجات جديده بطريقه سهله وكان مبسوط جدا ومتحمس طول فتره الكورس بصراحه شكرا ليكي يا بشمهندسه هدير شكرا لحبك وطيبتك مع الأطفال والتعامل الراقي جدا بجد اشكرك',
                'label' => 'Coding'
            ],
            [
                'id' => 7,
                'name' => 'هاجر',
                'stars' => 5,
                'content' => 'حقيقي الكورس ممتاز يا هدير و انت بتبذلي مجهود خرافي مع الولاد
ربنا يباركلك و يوفقك
الولاد مبسوطين جدا من الكورس و المسابقة و استفادوا كتير منها',
                'label' => 'FLL Competition'
            ],
            [
                'id' => 8,
                'name' => 'انتصار',
                'stars' => 5,
                'content' => 'ابني اخذ المستوى الاول في البرمجة وكان سعيد بالدروس والانشطة والتكليفات واتعلم كتير
طريقة المهندسة هدير لطيفة جدا وبتخلي الاولاد يحبوا المحتوي
وهي بتحاول تخلي الطفل يصلح اي خطأ في الكود بنفسه وبتعلمه التفكير النقدي',
                'label' => 'Coding'
            ],
            [
                'id' => 9,
                'name' => 'هاجر',
                'stars' => 5,
                'content' => 'اللهم بارك ماشاء الله كورس كان ممتع جدا و مهندسه هدير جميله و صابوره و حنينه و نفسها طويل مع ولاد و في اي وقت الولاد بتحتاجها تلاقيها و فعلا اسلوبها ممتع جدا و مشوق للعيال فعلا استمتعنا جدا اللهم بارك فيها و في علمها يارب
و حبيت الولاد في البرمجه جدا جدا',
                'label' => 'Coding'
            ],
            [
                'id' => 10,
                'name' => 'انتصار',
                'stars' => 5,
                'content' => 'تجربه جميله عرفنا فيها معنى البرمجه واساسياتها واستطاع ابنى انه يعمل بدايات لعبه الكترونيه طبعا كل دا بسبب مهندسة هدير متميزه ومخلصه في شغلها و متفهمه لطبيعة المراهقين',
                'label' => 'Coding'
            ],
        ];

        Testimonial::truncate();
        Testimonial::insert($testimonials);
    }
}


